-----НАБОР ТИПОВЫХ ДАННЫХ ДЛЯ ТАБЛИЦ-----

--Запонение таблицы `languages`
INSERT INTO `languages` (`language`)
VALUES
("en"),
("ru"),
("fr"),
("de"),
("cn");

--Запонение таблицы `publishing_houses`
INSERT INTO `publishing_houses` (`name`)
VALUES
("Астрель"),
("Азбука"),
("Русский вестник"),
("Росмэн"),
("Эксмо"),
("Фантом"),
("АСТ"),
("Иностранка"),
("Лабиринт");

--Запонение таблицы `genres`
INSERT INTO `genres` (`genre`)
VALUES
("новелла"),
("повесть"),
("пьеса"),
("рассказ"),
("роман"),
("пародия"),
("трагедия"),
("драма"),
("роман-эпопея"),
("сказка"),
("поэма"),
("драматические"),
("комедия"),
("триллер"),
("фэнтэзи"),
("роман-антиутопия"),
("исторический"),
("реализм"),
("фантастика"),
("поэма");

--Запонение таблицы `sales`
INSERT INTO `sales` (`date`,`time`,`id_book`,`count_book`,`id_price`)
VALUES
("2017-05-23", "10:08:57",1,1,4),
("2017-05-25", "16:13:30",3,2,3),
("2017-05-29", "17:00:57",8,1,6),
("2017-05-31", "10:58:50",4,3,2),
("2017-06-02", "12:16:24",6,1,3),
("2017-06-02", "14:37:57",5,1,4),
("2017-06-04", "15:49:00",11,2,9),
("2017-06-05", "11:08:07",17,1,1),
("2017-06-05", "17:59:16",13,1,7),
("2017-06-05", "18:12:00",21,1,9),
("2017-06-06", "18:21:24",9,1,7),
("2017-06-06", "13:13:57",7,1,5),
("2017-06-07", "15:51:45",16,1,5),
("2017-06-07", "17:08:28",19,1,3),
("2017-06-07", "19:58:36",22,1,9);

--Запонение таблицы `deliveries`
INSERT INTO `deliveries` (`id_book`,`id_prov`,`count_book``date`)
VALUES
(23,1,2,"2017-05-16"),
(16,2,1,"2017-05-16"),
(4,1,2,"2017-05-16"),
(5,4,1,"2017-05-21"),
(17,3,3,"2017-05-26"),
(21,1,4,"2017-05-26"),
(12,3,1,"2017-05-26"),
(6,4,2,"2017-05-31"),
(19,5,1,"2017-05-31"),
(3,1,3,"2017-05-31"),
(10,5,2,"2017-06-04");

--Запонение таблицы `books`
INSERT INTO `books` (`name_book`,`year`,`author`,`id_publ`,`id_lang`,`id_price`,`pages`)
VALUES
("13 причин почему",2011,"Джей Эшер",1,1,4,320),
("Хорошо быть тихоней",1999,"Стивен Чбоски",2,1,1,352), 
("Преступление и наказание",1866,"Ф.М. Достоевский",3,2,3,574),
("Гарри поттер и дары смерти",200,"Джоан Роулинг",4,1,2,329),
("451 градус по фаренгейту",1953,"Рэй Брэдбери",2,1,4,224),
("Унесенные ветром",1936,"Маргарет Митчелл",5,1,3,640),
("Прислуга",2009,"Кэтрин Стокетт",6,1,5,512),
("А зори здесь тихие",1971,"Б.Л. Васильев",2,2,6,384),
("Убить перемешника",1960,"Харпер Ли",7,1,7,288),
("Над пропастью во ржи",1951,"Джером Сэлинджер",5,1,5,213),
("Мастер и маргарита",1966,"М.А. Булгаков",2,2,9,358),
("Книжный вор",2005,"Маркус Зусак",5,1,10,560),
("Гордость и предубеждение",1813,"Джейн Остин",2,1,7,374),
("Бегущий по лабиринту",2009," Джеймс Дэшнер",7,1,5,448),
("Три мушкетера",1844,"Александр Дюма",5,3,3,667),
("До встречи с тобой",2012,"Джоджо Мойес",8,1,5,480),
("Лев, колдунья и платяной шкаф",1984,"Клайв Льюис",5,1,1,280),
("Война и мир. Том 1",1869,"Л.Н. Толстой",5,2,10,308),
("Анна Каренина",1877,"Ф. М. Достоевский",5,2,3,766),
("Алиса в стране чудес",1865,"Льюис Кэрролл",9,1,4,272),
("Бойцовский клуб",1996,"Чак Паланик",7,1,6,256),
("Великий гэтсби",1922,"Фрэнсис Фицджеральд",2,1,9,256),
("Маленький принц",1943,"Антуан де Сент-Экзюпери",7,3,8,86),
("Герой нашего времени",1940,"М.Ю. Лермонтов",2,2,1,257),
("Мертвые души",1842,"Н.В. Гоголь",2,2,3,550);

--Запонение таблицы `genres_books`
INSERT INTO `genres_books` (`id_book`,`id_genre`)
VALUES
(1,2),
(2,5),
(3,5),
(4,15),
(4,5),
(5,16,
(6,17),
(6,5),
(7,5),
(7,17),
(8,2),
(8,8),
(9,5),
(10,5),
(10,18),
(11,5),
(11,19),
(12,5),
(12,18),
(13,5),
(14,14),
(14,16),
(15,5),
(15,17),
(16,8),
(17,15),
(18,9),
(18,17),
(19,17),
(19,5),
(19,18),
(20,10),
(21,8),
(22,5),
(22,8),
(23,1),
(23,19),
(24,18),
(24,5),
(25,20);

--Запонение таблицы `prices`
INSERT INTO `prices` (`price`)
VALUES
(400),
(1100),
(320),
(210),
(500),
(430),
(450),
(220),
(300),
(150);

--Запонение таблицы `providers`
INSERT INTO `providers` (`name`,`address`,`phone`,`email`)
VALUES
("Продалит","ул. Байкальская 210","89965478496","prodalit@mail.ru"),
("Книги к вам спешат","ул. Байкальская 21","8999546521","booktoyou@mail.ru"),
("Все книги","ул. Лермонтова 73","89456244487","allbook@mail.ru"),
("Мир книг","ул. Ленина 54","89845613667","bookworld@gmail.com"),
("Чудесница","ул. Лермонтова 293","89245695651","magicshop@mail.ru"),
("Спеши читать","ул. Карла Маркса 23","83952465968","htoread@mail.ru"),
("Любомир","ул. Мирная 13","89145263453","lubomir@mail.ru");
